%2019-9-9
%本函数的作用是构造MA论文中的response test bed
%函数构造部分手动完成
clc;clear;
dim  = 6;%构造多项式的变量数
n = 30;
x = rand(n,dim)*1.6-0.3;
y = rand(n,1)*0.5+0.25;
tes = @(a)ls(a,x,y,n);
f = 15;
[x1,y1]=ga(tes,f,[],[],[],[],linspace(-1,-1,f),linspace(1,1,f));
[x2,y2]=ga(tes,f,[],[],[],[],linspace(-1,-1,f),linspace(1,1,f));
[x3,y3]=ga(tes,f,[],[],[],[],linspace(-1,-1,f),linspace(1,1,f));

function [yy]= ls(a,x,y,n)
form =[0,0,0,0,0,0;...%常数项
    1,0,0,0,0,0;...
    0,1,0,0,0,0;...
    0,0,1,0,0,0;...
    0,0,0,1,0,0;...
    0,0,0,0,1,0;...
    0,0,0,0,0,1;...%一阶主项
    2,0,0,0,0,0;...
    0,2,0,0,0,0;...
    0,0,0,0,2,0;...%二阶主项
    1,1,0,0,0,0;...
    0,1,1,0,0,0;...
    0,0,1,0,0,1;...
    0,0,0,1,1,0;...
    1,0,0,0,0,1];
for ii = 1:n
s(ii) = sum(prod(x(ii,:).^form,2).*a',1);
end
s=s';

yy = s-y;
yy = yy'*yy;
end
